app/controllers/sessions_controller.rb

  def create
    user = User.find_by(emailaddress: params[:session][:emailaddress])
---
SELECT  "users".* FROM "users" WHERE "users"."emailaddress" = ? LIMIT ?  [["emailaddress", "AlexEmail@AnEmailHoster.com"], ["LIMIT", 1]]