app/controllers/shifts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "shifts" ("starttime", "endtime", "shiftlength", "storeid", "ispublic", "created_at", "updated_at", "department") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      @theUser = User.find(session[:user_id])
      starttime = params[:starttime]
      endtime = params[:endtime]
      shiftlength = params[:shiftlength]
      department = params[:department]

      if starttime != nil && endtime != nil && shiftlength != nil && department != nil
        shift = Shift.new
        shift.starttime = starttime
        shift.endtime = endtime
        shift.shiftlength = shiftlength
        shift.storeid = @theUser.storeid
        shift.ispublic = true
        shift.department = department
        shift.save