app/controllers/site_pages_controller.rb

  def home
    @shifts = Shift.all
    @theUser = User.find(session[:user_id])
---
SELECT "shifts".* FROM "shifts"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def profile
    @theUser = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def listings
    if logged_in?
      @preferences = Preference.find_by(userid: session[:user_id])
      @shiftScore = 0
      @theUser = User.find(session[:user_id])
    end
    @shifts = Shift.all
---
SELECT  "preferences".* FROM "preferences" WHERE "preferences"."userid" = ? LIMIT ?  [["userid", 9], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "shifts".* FROM "shifts"

  def movePrivate
    if logged_in?
      @preferences = Preference.find_by(userid: session[:user_id])
      @shiftScore = 0
      @theUser = User.find(session[:user_id])
    end
    @shifts = Shift.all
    @shift = Shift.find(params[:id])
    @shift.update(ispublic: "false")
---
SELECT  "preferences".* FROM "preferences" WHERE "preferences"."userid" = ? LIMIT ?  [["userid", 11], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "shifts".* FROM "shifts"
SELECT  "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "shifts" SET "ispublic" = ?, "updated_at" = ? WHERE "shifts"."id" = ?  [["ispublic", "f"], ["updated_at", "2019-09-12 23:39:49.827778"], ["id", 11]]

  def movePublic
    @theUser = User.find(session[:user_id])
    @shifts = Shift.all
    @shift = Shift.find(params[:id])
    @shift.update(ispublic: "true")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "shifts".* FROM "shifts"
SELECT  "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "shifts" SET "ispublic" = ?, "updated_at" = ? WHERE "shifts"."id" = ?  [["ispublic", "t"], ["updated_at", "2019-09-12 23:44:21.630466"], ["id", 1]]

  def admin
    @users = User.all
    if logged_in?
      @theUser = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."userid" = ? LIMIT ?  [["userid", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def changeActivity
    @users = User.all
    @user = User.find(params[:id])
    if @user.isactive == false
      @user.update(isactive: "true")
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "isactive" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["isactive", "f"], ["updated_at", "2019-10-03 23:50:24.089370"], ["id", 1]]