app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."firstname" = ? LIMIT ?  [["firstname", "Fred"], ["LIMIT", 1]]
INSERT INTO "users" ("firstname", "lastname", "password", "phonenumber", "emailaddress", "ismanager", "isactive", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      firstname = params[:firstname]
      lastname = params[:lastname]
      password = params[:password]
      phonenumber = params[:phonenumber]
      emailaddress = params[:emailaddress]

      user = User.new
      user.firstname = firstname
      user.lastname = lastname
      user.password = password
      user.phonenumber = phonenumber
      user.emailaddress = emailaddress
      user.storeid = storeid
      user.isactive = true
      user.ismanager = false
      user.isadmin = false

      if user.valid?
        user.save